from gensim.summarization import summarize
import csv
from TextSummarization.Utils import convertListToString


class MultiLanguageSummarizer:
    def __init__(self):
        pass

    @staticmethod
    def summarize_text(text, split=True):
        return summarize(text, split=split)

    # @input list
    # @output string
#
#
# multiLanguageSummarizer = MultiLanguageSummarizer()
#
# with open('test_data.csv') as csv_file:
#     csv_reader = csv.reader(csv_file, delimiter=',')
#     line_count = 0
#     for row in csv_reader:
#         if line_count == 0:
#             print(f'Column names are {", ".join(row)}')
#             line_count += 1
#         elif len(row[1].strip()) > 5 and "VIDEO" not in row[2]:
#
#             heading, given_summary, article = row[0], row[1], row[2]
#             try:
#                 if "।" in article:
#                     article = article.replace("।", ".")
#                 generated_summary = MultiLanguageSummarizer.summarize_text(article, split=True)
#                 # print(f'Summary using library:\n{hindi_summary}\n')
#             except ValueError as e:
#                 continue
#                 # print(f'Error raised: {e}')
#             else:
#                 print(
#                     f'Article #{line_count}\nHeading:\n{heading}  \n\nSummary:\n{given_summary} '
#                     f'\n\nArticle:\n{article}\n')
#                 print(f'Summary using library:\n{convertListToString(generated_summary)}\n')
#
#                 print(f'\nLength testing.... \nHeading: {len(heading.strip().split(" "))} '
#                       f'\nGiven Summary:{len(given_summary.strip().split(" "))}'
#                       f'\nArticle:{len(article.strip().split(" "))}'
#                       f'\nGenerated summary: {len(convertListToString(generated_summary).strip().split(" "))}')
#
#                 print("=====" * 50 + '\n')
#
#                 line_count += 1
#
#         if line_count == 21:
#             break
#     print(f'Processed {line_count} lines.')
#
# hindi_text = """एक कहावत है 'खोदा पहाड़ निकली चुहिया.' 'साहो' देखने गए लोगों का फ़िल्म देखने के
# बाद इस कहावत से राब्ता हो सकता है. बाहुबली फ़िल्म के बाद अभिनेता प्रभास की धमाकेदार एंट्री की
# उम्मीद लेते हुए जब हम 'साहो' देखने पहुंचे तो केवल मायूसी ही हाथ लगी. ये फ़िल्म चार भाषाओं में एक
# साथ रिलीज़ हुई है. ज़ाहिर है प्रभास के इतने फैन्स हैं कि हर शहर में लोगों ने पहले ही इस फ़िल्म की
# बुकिंग करा रखी थी. 'बाहुबली' के बाद कुछ लोगों को इंतज़ार था कि इतने बड़े पैमाने की फ़िल्म के बाद
# ये फ़िल्म भी बॉक्स ऑफिस पर खरी उतरेगी. ऐसा नहीं है कि फ़िल्म में वैसा मसाला नहीं है जो इस तरह की
# फ़िल्म में होना चाहिए. फ़िल्म में साथी कलाकार के रूप में जैकी श्रॉफ, टीनू आनंद, चंकी पांडे,
# मंदिरा बेदी, अरुण विजय, प्रकाश बेलावाडी जैसे कई मंझे हुए कलाकार हैं. पर उनके पास फ़िल्म में कुछ
# ख़ास करने के लिए नहीं है. एक तरह से देखा जाए तो ये सब केवल कुछ पात्रों को भरने के लिए ही रखे गए
# हैं. फ़िल्म एक काल्पनिक शहर वाजीपुर से शुरू होती है. जहां पर जैकी श्रॉफ रॉय नाम का अंपायर चलाते
# हैं. वो काला धंधा करते हैं और उनकी शाखाएं देश-विदेश में फैली हुई हैं. पर कुछ इज़्जत कमाने के लिए
# वो स्टील की एक फैक्ट्री लगाना चाहते हैं जिसके लिए उनको कुछ राजनीतिज्ञों की मदद की ज़रूरत पड़ती
# है. उनके दल के कुछ सदस्य ऐसे हैं जो उनसे बदला लेना चाहते हैं. इस रंजिश में जैकी श्रॉफ की हत्या हो
# जाती है. इसके बाद कहानी कई देशों में घूमती है. जहां चीन, अफ्रीका और कुछ भारत के लोग भी शामिल हैं.
# दूसरी ओर बंबई में कुछ पुलिस अफसर हैं जो रॉय अंपायर के फैले धंधे से परेशान हैं. इनमें शामिल हैं
# मुरली, श्रद्धा कपूर और प्रभास. जब प्रभास ठान लेते हैं कि वो रॉय अंपायर का खात्मा कर देंगे तब शुरू
# होती है लड़ाई पुलिस और अंडरवर्ल्ड की. रॉय अंपायर एक ब्लैकबॉक्स की तलाश में होता है जिसके खुलने से
# उनके हाथ बहुत-सी पूंजी लगेगी. लेकिन इस ब्लैकबॉक्स के बारे में पुलिस को पहले से ही पता होता है.
# प्रभास: मैं हिन्दी में लिखता और पढ़ता हूँ विद्या बालन ने क्यों कहा- वो ख़ुद को धार्मिक नहीं बताना
# चाहतीं इसके बाद फ़िल्म की कहानी रुक जाती है और चूहे-बिल्ली के खेल की तरह पुलिस और अंडरवर्ल्ड के
# बीच तनाव शुरू हो जाता है. इसके अलावा प्लॉट के नाम पर फ़िल्म शून्य है. हालांकि फ़िल्म की गति तो
# तेज़ हो जाती है लेकिन उस दौरान हम सिर्फ़ तमाम गाड़ियां उड़ते हुए देखते हैं और बहुत तेज़ एक्शन के
# चलते कुछ किरदारों को आते-जाते देखते हैं. इसी बीच फ़िल्म में दो-तीन गाने और नाच ठूंसा गया है.
# ज़ाहिर है कि प्रभास के साथ श्रद्धा कपूर का रोमांस फिल्म में जोड़ना ज़रूरी था. इसी दौरान हमें नील
# नितिन मुकेश भी नज़र आते हैं जिनको लेकर ये संशय बना रहता है कि वो पुलिस के आदमी हैं या अंडरवर्ल्ड
# के. प्रभास पूरी फ़िल्म में छाए रहते हैं और कुछ सस्पेंस रखते हुए हमें ये भी नहीं पता चल पाता कि वो
# पुलिस में हैं भी या नहीं. ऐसे कई सीन हैं जहां डायलॉग की कमी खलती है. शायद उनकी हिंदी इतनी अच्छी
# नहीं है इसी वजह से वो एक्शन करते हुए ज़्यादा नज़र आते हैं. फ़िल्म में सीजीआई (कंप्यूटर जेनरेटेड
# इमेज़री) के ज़रिए कुछ रोमांच से भरे दृश्य ज़रूर हैं जो वास्तविकता से बहुत दूर हैं और केवल दर्शकों
# को खुश करने के लिए रखे गए हैं. तकनीकी दृष्टि से देखा जाए तो ये सीन किसी भी हॉलीवुड फ़िल्म की
# टक्कर के हैं. कमी है तो सिर्फ़ एक कहानी की. क्योंकि केवल एक्शन के बल पर तीन घंटे फ़िल्म को झेलना
# मुश्किल हो जाता है. प्रभास को एक लोकप्रिय बॉलीवुड निर्देशक की फ़िल्म से शुरुआत करनी चाहिए थी.
# लेकिन शायद बाहुबली का प्रभाव इतना अधिक है कि वो उसी में अपने आप को ढाले हुए हैं. कुछ सलमान और
# अक्षय कुमार की फ़िल्मों का भी असर होगा. इसके अलावा उत्तर भारत में अपना रंग जमाने के उद्देश्य से
# ही उन्होंने ऐसी फ़िल्म का चयन किया है जिसमें केवल उनके सिक्स पैक्स एब्स, एक लाइन की कहानी,
# तीन गाने और बहुत सारा एक्शन ही फ़िल्म में मौजूद है. फ़िल्म देखने के बाद बस एक ही बात दिल से
# निकलती है कि काश फ़िल्म में एक प्लॉट भी होता. """
#
# test_data = """पत्र में यह भी कहा गया है कि अपूर्वा को इसलिए फंसाया गया होगा क्योंकि तिवारी परिवार उसे अपनी जायदाद में कोई हिस्सा नहीं देना चाहता. सूत्रों ने बताया कि हालांकि परिवार ने दावा किया कि यह पत्र अपूर्वा के पिता की ओर से लिखा गया है जो इंदौर में जाने-माने वकील हैं और बार एसोसिएशन में ऊंचे पद पर हैं. पुलिस ने तिवारी के डिफेंस कॉलोनी आवास के लैंडलाइन नंबर की जानकारियां मांगी है. 
# उन्होंने अपूर्वा के नाखून के नमूने भी लिए हैं ताकि यह पता लगाया जा सके कि क्या लड़ाई के दौरान तिवारी की त्वचा नाखूनों में फंसी थी या वहां कोई अन्य डीएनए मौजूद था. हालांकि सूत्रों ने बताया कि कोई सुराग मिलने की संभावना कम है क्योंकि नमूने हत्या के कुछ दिनों बाद लिए गए. इस मामले की पहले छानबीन करने वाली दक्षिण जिला पुलिस ने तिवारी को मृत घोषित किए जाने के बाद 16 अप्रैल को कमरा सील कर दिया था. शुरुआत में ऐसा संदेह था कि उनकी मौत स्वाभाविक कारणों से हुई, लेकिन पोस्टमार्टम में यह साफ हो गया कि उनकी तकिये से ‘‘गला घोंटकर'' हत्या की गई.  पुलिस ने बताया कि अपूर्वा देर रात करीब एक बजे तिवारी की हत्या करने के बाद कई बार कमरे में गई तो घटनास्थल के साथ छेड़छाड़ करने की संभावना बहुत अधिक है. पुलिस अधिकारी ने कहा, ‘‘उसने बेडशीट और तकियों के साथ छेड़छाड़ की कोशिश की होगी और सबूत नष्ट करने के लिए कमरा साफ करने की कोशिश की होगी.'' उनके अनुसार, अपूर्वा ने अपने हाथों से तिवारी का गला घोंटा और फिर तकिये का इस्तेमाल किया ताकि वह मदद के लिए ना चिल्ला सके. उसने करीब 14 घंटे तक तिवारी की मौत की बात छिपाए रखी. 
# अपूर्वा को बुधवार को डिफेंस कॉलोनी स्थित आवास ले जाया गया जहां पुलिस ने घटना का नाटकीय रूपांतरण किया तिवारी के परिवार के सदस्यों को संदेह है कि हत्या से पहले अपूर्वा ने कथित तौर पर उसे नशा दिया. विसरा रिपोर्ट से ही यह पुष्टि हो पाएगी कि क्या उन्हें नशा दिया गया था या नहीं. बेडशीट, तकिये और तिवारी के कपड़ों को फॉरेंसिक जांच के लिए भेज दिया गया है. पुलिस ने बताया कि तिवारी को जल्दी गुस्सा आ जाता था और शादी के एक साल में ही उनके बीच मामूली मुद्दों को लेकर अक्सर झगड़ा होता था. पुलिस अधिकारी ने अपूर्वा की मनोचिकित्सा जांच की किसी भी संभावना को खारिज कर दिया.
# """
#
#
# t = MultiLanguageSummarizer()
#
# generated_summary = t.summarize_text(test_data)
# print(f'Output Summary: {convertListToString(generated_summary)}')
